#include <iostream>
#include<iomanip>
#include <conio.h>
#include "11-b1-datetime.h"
using namespace std;

int main()
{
	if (1) {
		DateTime d1;             //1900-01-01 00:00:00
		DateTime d2(2016, 4, 28,10,31,57);  //2016-04-28 10:31:57

		cout << "测试初始化，完全正确的赋值" << endl;

		cout << "d1应该是1900-01-01 00:00:00，实际为：";
		d1.dtshow();
		cout << endl;
		cout << "d2应该是2016-04-28 10:31:57，实际为：";
		d2.dtshow();
		cout << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1(1870, 3, 15,21,2,33);  //1900-01-01 21:02:33
		DateTime d2(2112, 3, 4,25,12,8);   //1900-01-01 00:00:00
		DateTime d3(2005, 13, 15,4,69,17); //1900-01-01 00:00:00
		DateTime d4(2016, 4, 32,14,32,66);  //1900-01-01 00:00:00

		cout << "测试初始化，年、月、日非法" << endl;

		cout << "d1应该是1900-01-01 21:02:33，实际为：";
		d1.dtshow();
		cout << endl;
		cout << "d2应该是1900-01-01 00:00:00，实际为：";
		d2.dtshow();
		cout << endl;
		cout << "d3应该是1900-01-01 00:00:00，实际为：";
		d3.dtshow();
		cout << endl;
		cout << "d4应该是1900-01-01 00:00:00，实际为：";
		d4.dtshow();
		cout << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1(2015, 2, 29,10,11,12);   //1900-01-01 10:11:12
		DateTime d2(2016, 2, 29,13,14,15);   //2016-02-29 13:14:15

		cout << "测试初始化" << endl;

		cout << "d1应该是1900-01-01 10:11:12，实际为：";
		d1.dtshow();
		cout << endl;
		cout << "d2应该是2016-02-29 13:14:15，实际为：";
		d2.dtshow();
		cout << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1, d2, d3; //都是1900-01-01 00:00:00

		cout << "测试set" << endl;
		d1.dtset(2016, 2, 29,12,18,61);	//2016-02-29 00:00:00
		d2.dtset(2015, 2,29,12,18,51);		//1900-01-01 12:18:51
		d3.dtset(2016,12,22,5,46,17);		//2016-12-22 05:46:17

		cout << "d1应该是2016-02-29 00:00:00，实际为：";
		d1.dtshow();
		cout << endl;
		cout << "d2应该是1900-01-01 12:18:51，实际为：";
		d2.dtshow();
		cout << endl;
		cout << "d3应该是2016-12-22 05:46:17，实际为：";
		d3.dtshow();
		cout << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1(2016, 4, 28, 8, 8, 8);
		DateTime d2(2016, 5, 20, 8, 8, 8);
		DateTime d3(2016, 4, 28, 8, 8, 8);
		DateTime d4(2016, 4, 28, 8, 8, 8);
		DateTime d5(2016, 4, 28, 8, 8, 8);
		DateTime d6(2016, 4, 28, 8, 8, 8);

		cout << "测试set，非法" << endl;

		d1.dtset(2112, 1, 5,6,6,6);     //1900-01-01 06:06:06
		d2.dtset(2014, 2, 29,6,6,6);     //1900-01-01 06:06:06
		d3.dtset(2015, 15, 22,6,6,6);  //1900-01-01 06:06:06
		d4.dtset(2017, 1, 12,27,20,4); //2017-01-12 00:00:00
		d5.dtset(2017, 1, 12, 21, 64, 4); //2017-01-12 00:00:00
		d6.dtset(2017, 1, 12, 21, 20, 84); //2017-01-12 00:00:00

		cout << "d1应该是1900-01-01 06:06:06，实际为：";
		d1.dtshow();
		cout << endl;
		cout << "d2应该是1900-01-01 06:06:06，实际为：";
		d2.dtshow();
		cout << endl;
		cout << "d3应该是1900-01-01 06:06:06，实际为：";
		d3.dtshow();
		cout << endl;
		cout << "d4应该是2017-01-12 00:00:00，实际为：";
		d4.dtshow();
		cout << endl;
		cout << "d5应该是2017-01-12 00:00:00，实际为：";
		d5.dtshow();
		cout << endl;
		cout << "d6应该是2017-01-12 00:00:00，实际为：";
		d6.dtshow();
		cout << endl;

		d6.dtset(2017, 1, 12, 21, 20, 4); //2017-01-12 21:20:04
		cout << "d6应该是2017-01-12 21:20:04，实际为：";
		d6.dtshow();
		cout << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1(2016, 4, 28,15,37,9);
		int y, m, d, h, mi, s;

		cout << "测试get" << endl;
		d1.dtget(y, m, d, h, mi, s);

		cout << "应该y=2016,m=4,d=28,h=15,mi=37,s=9，实际为：";
		cout << "y=" << y << ",m=" << m << ",d=" << d <<",h="<<h<<",mi="<<mi<<",s="<<s<< endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1(2016, 4, 28, 15, 37, 9);
		DateTime d2;

		cout << "测试cout" << endl;
		cout << "d1应该是2016-04-28 15:37:09，实际为：" << d1 << endl;
		cout << "d2应该是1900-01-01 00:00:00，实际为：" << d2 << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	/*if (1) {
		DateTime d1;

		cout << "测试cin/cout" << endl;

		cout << "请输入2016 4 28 15 37 9" << endl;
		cin >> d1;
		cout << "d1应该是2016-04-28 15:37:09，实际为：" << d1 << endl;

		cout << "请输入2016 2 29 22 41 57" << endl;
		cin >> d1;
		cout << "d1应该是2016-02-29 22:41:57，实际为：" << d1 << endl;

		cout << "请输入2015 2 29 22 41 57" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 22:41:57，实际为：" << d1 << endl;

		cout << "请输入1899 4 10 15 37 9" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 15:37:09，实际为：" << d1 << endl;

		cout << "请输入2016 13 10 15 37 9" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 15:37:09，实际为：" << d1 << endl;

		cout << "请输入2016 4 31 15 37 9" << endl;
		cin >> d1;
		cout << "d1应该是1900-01-01 15:37:09，实际为：" << d1 << endl;

		cout << "请输入2016 4 28 25 37 9" << endl;
		cin >> d1;
		cout << "d1应该是2016-04-28 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2016 4 28 22 73 9" << endl;
		cin >> d1;
		cout << "d1应该是2016-04-28 00:00:00，实际为：" << d1 << endl;

		cout << "请输入2016 4 28 22 37 90" << endl;
		cin >> d1;
		cout << "d1应该是2016-04-28 00:00:00，实际为：" << d1 << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}*/

	if (1) {
		DateTime d1(1);          //1900-01-01 00:00:01
		DateTime d2(long long(6311433599));      //2099-12-31 23:59:59
		DateTime d3(-1);       //2099-12-31 23:59:59
		DateTime d4(long long(6311433601));      //1900-01-01 00:00:01
		DateTime d5;

		cout << "转换构造函数测试，包括合法及非法值" << endl;

		cout << "d1应该是1900-01-01 00:00:01，实际为：";
		d1.dtshow();
		cout << endl;
		cout << "d2应该是2099-12-31 23:59:59，实际为：";
		d2.dtshow();
		cout << endl;
		cout << "d3应该是2099-12-31 23:59:59，实际为：";
		d3.dtshow();
		cout << endl;
		cout << "d4应该是1900-01-01 00:00:01，实际为：";
		d4.dtshow();
		cout << endl;

		d5 = 6311433599;
		cout << "d5应该是2099-12-31 23:59:59，实际为：";
		d5.dtshow();
		cout << endl;

		d5 = 6311433601;
		cout << "d5应该是1900-01-01 00:00:01，实际为：";
		d5.dtshow();
		cout << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1(1900, 1, 1,0,0,1);
		DateTime d2(2099, 12, 31,23,59,59);
		DateTime d3(1982, 2, 19,12,41,33);
		DateTime d4(2016, 4, 28,2,1,3);

		cout << "类型转换函数测试，包括合法及非法值" << endl;

		cout << "d1应该是1，     实际为：" << long long(d1) << endl;
		cout << "d2应该是6311433599，实际为：" << long long(d2) << endl;
		cout << "d3应该是2591959293，实际为：" << long long(d3) << endl;
		cout << "d4应该是3670797663，实际为：" << long long(d4) << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1(2016, 4, 28,1,2,3);
		DateTime d2;

		cout << "测试+/- " << endl;

		d2 = d1 + long long(27);
		cout << "d2应该是2016-04-28 01:02:30，实际为：" << d2 << endl;

		d2 = d1 + long long(86401);
		cout << "d2应该是2016-04-29 01:02:04，实际为：" << d2 << endl;

		d2 = long long(27) + d1;
		cout << "d2应该是2016-04-28 01:02:30，实际为：" << d2 << endl;

		d2 = long long(64) + d1;
		cout << "d2应该是2016-04-28 01:03:07，实际为：" << d2 << endl;

		d2 = d1 - long long(7);
		cout << "d2应该是2016-04-28 01:01:56，实际为：" << d2 << endl;

		d2 = d1 - long long(3602);
		cout << "d2应该是2016-04-28 00:02:01，实际为：" << d2 << endl;

		d2 = d1 - long long(2419200);
		cout << "d2应该是2016-03-31 01:01:56，实际为：" << d2 << endl;

		d1.dtset(2016, 2, 28,23,58,45);
		d2 = d1 + long long(77);
		cout << "d2应该是2016-02-29 00:00:02，实际为：" << d2 << endl;

		d1.dtset(2015, 2, 28, 23, 58, 45);
		d2 = d1 + long long(77);
		cout << "d2应该是2015-03-01 00:00:02，实际为：" << d2 << endl;

		d1.dtset(2010, 12, 31, 23, 58, 45);
		d2 = d1 + long long(77);
		cout << "d2应该是2011-01-01 00:00:02，实际为：" << d2 << endl;

		d1.dtset(1900, 1, 1,0,0,3);
		d2 = d1 - long long(10);
		cout << "d2应该是2099-12-31 23:59:53，实际为：" << d2 << endl;

		d1.dtset(2099, 12, 31,23,59,58);
		d2 = d1 + long long(5);
		cout << "d2应该是1900-01-01 00:00:03，实际为：" << d2 << endl;

		d1.dtset(2016, 4, 28,1,2,3);
		d2.dtset(2016, 4, 28,2,3,4);
		cout << "d1-d2应该是-3661，实际为：" << d1 - d2 << endl;

		d1.dtset(2016, 4, 28,0,0,0);
		d2.dtset(2016, 4, 29,0,0,1);
		cout << "d2-d1应该是86401，实际为：" << d2 - d1 << endl;

		d1.dtset(2016, 4, 28,0,0,0);
		d2.dtset(2015, 4, 28,0,0,0);
		cout << "d1-d2应该是31622400，实际为：" << d1 - d2 << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		DateTime d1, d2;

		cout << "测试++/--" << endl;

		d1.dtset(2016, 5, 1,23,59,59);
		d2 = d1++;
		cout << "d1应该是2016-05-02 00:00:00，实际为：" << d1 << endl;
		cout << "d2应该是2016-05-01 23:59:59，实际为：" << d2 << endl;

		d1.dtset(2016, 5, 1, 23, 59, 59);
		d2 = ++d1;
		cout << "d1应该是2016-05-02 00:00:00，实际为：" << d1 << endl;
		cout << "d2应该是2016-05-02 00:00:00，实际为：" << d2 << endl;

		d1.dtset(2016, 5, 1,0,0,0);
		d2 = d1--;
		cout << "d1应该是2016-04-30 23:59:59，实际为：" << d1 << endl;
		cout << "d2应该是2016-05-01 00:00:00，实际为：" << d2 << endl;

		d1.dtset(2016, 5, 1,0,0,0);
		d2 = --d1;
		cout << "d1应该是2016-04-30 23:59:59，实际为：" << d1 << endl;
		cout << "d2应该是2016-04-30 23:59:59，实际为：" << d2 << endl;

		d1.dtset(2012, 12, 31,23,59,59);
		d2 = d1++;
		cout << "d1应该是2013-01-01 00:00:00，实际为：" << d1 << endl;
		cout << "d2应该是2012-12-31 23:59:59，实际为：" << d2 << endl;

		d1.dtset(2016, 1, 1,0,0,0);
		d2 = d1--;
		cout << "d1应该是2015.12.31 23:59:59，实际为：" << d1 << endl;
		cout << "d2应该是2016-01-01 00:00:00，实际为：" << d2 << endl;

		d1.dtset(2016, 2, 28,23,59,59);
		d2 = d1++;
		cout << "d1应该是2016-02-29 00:00:00，实际为：" << d1 << endl;
		cout << "d2应该是2016-02-28 26:59:59，实际为：" << d2 << endl;

		d1.dtset(2015, 2, 28,23,59,59);
		d2 = d1++;
		cout << "d1应该是2015-03-01 00:00:00，实际为：" << d1 << endl;
		cout << "d2应该是2015-02-28 23:59:59，实际为：" << d2 << endl;

		d1.dtset(2016, 3, 1,0,0,0);
		d2 = d1--;
		cout << "d1应该是2016-02-29 23:59:59，实际为：" << d1 << endl;
		cout << "d2应该是2016-03-01 00:00:00，实际为：" << d2 << endl;

		d1.dtset(2015, 3, 1,0,0,0);
		d2 = d1--;
		cout << "d1应该是2015-02-28 23:59:59，实际为：" << d1 << endl;
		cout << "d2应该是2015-03-01 00:00:00，实际为：" << d2 << endl;

		d1.dtset(2099, 12, 31,23,59,59);
		d2 = d1++;
		cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;
		cout << "d2应该是2099-12-31 23:59:59，实际为：" << d2 << endl;

		d1.dtset(1900, 1, 1,0,0,0);
		d2 = d1--;
		cout << "d1应该是2099-12-31 23:59:59，实际为：" << d1 << endl;
		cout << "d2应该是1900-01-01 00:00:00，实际为：" << d2 << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	if (1) {
		/* 测试比较运算符 */
		DateTime d1(2016, 4, 28,0,0,0);
		DateTime d2(2016, 4, 28,0,0,0);
		DateTime d3(2016, 4, 27,23,59,56);

		cout << "测试比较运算符" << endl;

		cout << "比较结果应为0，实际为：" << (d1 >  d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 >= d2) << endl;
		cout << "比较结果应为0，实际为：" << (d1 <  d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 <= d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 == d2) << endl;
		cout << "比较结果应为0，实际为：" << (d1 != d2) << endl;

		cout << "比较结果应为1，实际为：" << (d1 >  d3) << endl;
		cout << "比较结果应为1，实际为：" << (d1 >= d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 <  d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 <= d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 == d3) << endl;
		cout << "比较结果应为1，实际为：" << (d1 != d3) << endl;

		cout << "任意键继续..." << endl;
		_getch();
		cout << endl;
	}

	return 0;
}